EDT/УТ/src/Catalogs/новаПользователи/новаПользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаПользователи</name>
  <attributes>
    <name>КонфигурацияКарт</name>
    <type>
      <types>CatalogRef.новаКонфигурацииКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассификаторРайонов</name>
    <type>
      <types>CatalogRef.новаКлассификаторРайонов</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаОформленияЖурналов</name>
    <type>
      <types>CatalogRef.новаСхемыОформленияЖурналов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасовойПояс</name>
    <comment>смещение времени часового пояса от ГМ (часов)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяОрганизация</name>
    <type>
      <types>CatalogRef.новаОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяКасса</name>
    <type>
      <types>CatalogRef.новаКассы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПланЗагрузки</name>
    <type>
      <types>CatalogRef.новаОбменыДанными</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПланВыгрузки</name>
    <type>
      <types>CatalogRef.новаОбменыДанными</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПосредническойУслугиПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяСтраховаяКомпания</name>
    <type>
      <types>CatalogRef.новаКонтрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоискАдресаПоКнопке</name>
    <comment>В форме выбора адреса скрывает или открывает кнопку искать. При скрытой кнопке ищет после ввода 3 символов</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательКСЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольКСЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальнаяШирота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальнаяДолгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяШирота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяДолгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсекатьДоставкиПоВесу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УсекатьДоставкиПоОбъему</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УсекатьТранспортПоГрузоподъемности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УсекатьТранспортПоГрузовместимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрокси</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойВариантНастройкиПланированияПоКарте</name>
    <type>
      <types>CatalogRef.новаВаринтыНастройкиПланированияПоКарте</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеОкноДоступностиТранспорта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсекатьДоставкиПоРедактируемомуРейсу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТочкиДоставки</name>
    <attributes>
      <name>ТочкаДоставки</name>
      <type>
        <types>CatalogRef.новаТочкиДоставки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Районы</name>
    <attributes>
      <name>Район</name>
      <type>
        <types>CatalogRef.новаГеоРайоны</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Роли</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.новаРолиУТЛ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/CommonModules/новаУправлениеПользователями/Module.bsl
//Возвращает георамку пользователя, если она не назначена, 
//возвращается георамка Санкт-Петербурга
//
//  Параметры:
//    Пользователь - <СправочникСсылка.новаПользователи> пользователь,
//                   для которого определяется георамка
//
//  Возвращаемое значение:
//    <Структура>
//      МинимальнаяШирота - <Число 20,17> минимальная георамки
//      МинимальнаяДолгота - <Число 20,17> минимальная долгота георамки
//      МаксимальнаяШирота - <Число 20,17> максимальная широта георамки
//      МаксимальнаяДолгота - <Число 20,17> максимальная долгота георамки
//
Функция ПолучитьГеорамкуПоУмолчанию(Пользователь = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("МинимальнаяШирота", 0);
	Результат.Вставить("МинимальнаяДолгота", 0);
	Результат.Вставить("МаксимальнаяШирота", 0);
	Результат.Вставить("МаксимальнаяДолгота", 0);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|    МинимальнаяШирота
	|    ,МинимальнаяДолгота
	|    ,МаксимальнаяШирота
	|    ,МаксимальнаяДолгота
	|  ИЗ
	|    Справочник.новаПользователи
	|  ГДЕ
	|    Ссылка = &Пользователь
	|");
	
	Запрос.УстановитьПараметр("Пользователь", ?(Пользователь = Неопределено, ПараметрыСеанса.новаТекущийПользователь, Пользователь));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Результат.МинимальнаяШирота = Выборка.МинимальнаяШирота;
		Результат.МинимальнаяДолгота = Выборка.МинимальнаяДолгота;
		Результат.МаксимальнаяШирота = Выборка.МаксимальнаяШирота;
		Результат.МаксимальнаяДолгота = Выборка.МаксимальнаяДолгота;
	КонецЕсли;
	
	Если Результат.МинимальнаяШирота = Результат.МаксимальнаяШирота
	     или Результат.МинимальнаяДолгота = Результат.МаксимальнаяДолгота Тогда
		
		ГеорамкаПоУмолчанию = новаКарты.ПолучитьСписокГеорамокПоУмолчанию().Найти("СанктПетербург", "Имя");
		Если ГеорамкаПоУмолчанию <> Неопределено Тогда
			
			Результат.МинимальнаяШирота = ГеорамкаПоУмолчанию.МинимальнаяШирота;
			Результат.МинимальнаяДолгота = ГеорамкаПоУмолчанию.МинимальнаяДолгота;
			Результат.МаксимальнаяШирота = ГеорамкаПоУмолчанию.МаксимальнаяШирота;
			Результат.МаксимальнаяДолгота = ГеорамкаПоУмолчанию.МаксимальнаяДолгота;
		КонецЕсли;
	КонецЕсли;;
	
	Возврат Результат;
	
КонецФункции
 
//Проверяет наличие прав на подключение к КСЛ у текущего пользователя
//
//  Параметры:
//    ТихийРежим  - <Булево> Истина - вывести предупреждение, если прав не хватает.
//
//  Возвращаемое значение:
//    <Булево> - Истина, пользователь может подключиться к КСЛ
//               Ложь, пользователю отказано в доступе
//
Функция ПользовательИмеетПравоРаботатьСКСЛ(ТихийРежим = Ложь) Экспорт
	
	Результат = Истина;
	
	//Если не ( РольДоступна(Метаданные.Роли.новаАдминистраторУТЛ)
	//          или РольДоступна(Метаданные.Роли.новаПользовательУТЛ)) Тогда
	//	
	//	#Если Клиент Тогда
	//		Если не ТихийРежим Тогда
	//			
	//			Предупреждение("У Вас нет прав для использования модулей" + Символы.ПС + "конфигурации ""Управление транспортной логистикой""." + Символы.ПС + "Обратитесь к администратору");
	//		КонецЕсли;
	//	#КонецЕсли
	//	
	//	Результат = Ложь;
	//КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
